# ============================================================================
# BREWFILE - Homebrew Package Installation
# ============================================================================
# This file contains all packages required for your zsh configuration
# Install with: brew bundle install --file=Brewfile
# ============================================================================

# ============================================================================
# ESSENTIAL TOOLS
# ============================================================================
brew "git"              # Version control system
brew "curl"             # Network data transfer tool
brew "zsh"              # Shell (usually pre-installed on macOS)

# ============================================================================
# TERMINAL & PROMPT
# ============================================================================
brew "starship"         # Cross-shell prompt
brew "eza"              # Modern ls replacement with icons
brew "fzf"              # Fuzzy finder for files and commands

# ============================================================================
# EDITORS
# ============================================================================
brew "neovim"           # Modern vim-based text editor

# ============================================================================
# FILE VIEWERS & PROCESSORS
# ============================================================================
brew "bat"              # Cat with syntax highlighting
brew "jq"               # JSON processor

# ============================================================================
# DEVELOPMENT TOOLS
# ============================================================================
brew "gh"               # GitHub CLI
brew "go"               # Go programming language

# ============================================================================
# DATABASES
# ============================================================================
brew "sqlite"           # SQLite database
brew "libpq"            # PostgreSQL client library

# ============================================================================
# NODE VERSION MANAGEMENT
# ============================================================================
brew "nvm"              # Node Version Manager

# ============================================================================
# PYTHON TOOLS
# ============================================================================
brew "uv"               # Fast Python package installer

# ============================================================================
# ARCHIVE UTILITIES (for extract function)
# ============================================================================
brew "unrar"            # RAR archive extraction
brew "p7zip"            # 7-Zip archive support
